app/controllers/movies_controller.rb

  def find_movies_with_same_director
    @movie = Movie.find(params[:id])

    if @movie.director.blank?
      redirect_to movies_path
    else
      @same_director = Movie.where(director: @movie.director)

      if @same_director.any?
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "movies".* FROM "movies" WHERE "movies"."director" = ?  ORDER BY "movies"."id" ASC LIMIT 1  [["director", "George Lucas"]]
SELECT COUNT(*) FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]